import 'dart:async';
import 'dart:convert';

import 'package:rxdart/rxdart.dart';
import 'package:shared/lyric/lyric_parser.dart';
import 'package:shared/lyric/next/next_word_based_lyric_corrector.dart';

class ChunkedWordInfo {
  final Duration begin;
  final Duration? end;
  final WordInfo wordInfo;

  const ChunkedWordInfo(this.begin, this.end, this.wordInfo);

  bool contains(Duration position) {
    if (end == null) {
      return position >= begin;
    }
    return position >= begin && position < end!;
  }
}

class ChunkedLyric {
  final Duration begin;
  final Duration? end;
  final CombinedLyric lyric;

  const ChunkedLyric(this.begin, this.end, this.lyric);

  bool contains(Duration position) {
    if (end == null) {
      return position >= begin;
    }
    return position >= begin && position < end!;
  }
}

class LyricChunker {
  static List<ChunkedWordInfo> makeWordInfos(List<WordInfo> wordInfos) {
    final result = <ChunkedWordInfo>[];
    for (int i = 0; i < wordInfos.length; i++) {
      final wordInfo = wordInfos[i];
      final next = i >= wordInfos.length - 1 ? null : wordInfos[i + 1];
      if (next == null) {
        result.add(
          ChunkedWordInfo(
            wordInfo.position,
            wordInfo.position + wordInfo.duration,
            wordInfo,
          ),
        );
        continue;
      }
      if (wordInfo.position + wordInfo.duration >= next.position) {
        result.add(ChunkedWordInfo(wordInfo.position, next.position, wordInfo));
        continue;
      }
      result.add(
        ChunkedWordInfo(
          wordInfo.position,
          wordInfo.position + wordInfo.duration,
          wordInfo,
        ),
      );
    }
    return result;
  }

  static List<ChunkedLyric> makeLyrics(List<CombinedLyric> combinedLyrics) {
    final result = <ChunkedLyric>[];
    for (int i = 0; i < combinedLyrics.length; i++) {
      final lyric = combinedLyrics[i];
      final next =
          i >= combinedLyrics.length - 1 ? null : combinedLyrics[i + 1];
      if (next == null) {
        result.add(ChunkedLyric(lyric.position, null, lyric));
        continue;
      }
      result.add(ChunkedLyric(lyric.position, next.position, lyric));
    }
    return result;
  }
}

class ScheduledLyric {
  final int index;
  final CombinedLyric lyric;

  const ScheduledLyric(this.index, this.lyric);
}

class NextRawLyricScheduler {
  final List<CombinedLyric> combinedLyrics;
  final Stream<Duration> positionStream;

  int? previousIndex;
  List<ChunkedLyric>? chunkedLyrics;
  BehaviorSubject<ScheduledLyric?>? lyricSubject;
  StreamSubscription? positionSubscription;

  NextRawLyricScheduler(this.combinedLyrics, this.positionStream);

  void prepare() {
    chunkedLyrics = LyricChunker.makeLyrics(combinedLyrics);
    lyricSubject = BehaviorSubject.seeded(null);
  }

  void start() {
    if (chunkedLyrics == null || chunkedLyrics?.isEmpty == true) {
      return;
    }
    if (lyricSubject == null || lyricSubject?.isClosed == true) {
      return;
    }
    positionSubscription = positionStream.listen(_onPosition);
  }

  void _onPosition(Duration position) {
    if (chunkedLyrics == null || chunkedLyrics?.isEmpty == true) {
      return;
    }
    if (lyricSubject == null || lyricSubject?.isClosed == true) {
      return;
    }
    int? index;
    ChunkedLyric? chunkedLyric;

    for (int i = 0; i < chunkedLyrics!.length; i++) {
      final chunk = chunkedLyrics![i];
      if (chunk.contains(position)) {
        chunkedLyric = chunk;
        index = i;
        break;
      }
    }
    if (index == null || chunkedLyric == null) {
      return;
    }
    if (index == previousIndex) {
      return;
    }
    previousIndex = index;

    lyricSubject!.add(ScheduledLyric(index, chunkedLyric.lyric));
  }

  void dispose() {
    combinedLyrics.clear();
    chunkedLyrics?.clear();
    chunkedLyrics = null;
    lyricSubject?.close();
    lyricSubject = null;
    positionSubscription?.cancel();
    positionSubscription = null;
  }
}

class ScheduledWordBasedLyric {
  final int index;
  final int wordIndex;
  final CombinedLyric lyric;
  final List<WordInfo> wordInfos;

  const ScheduledWordBasedLyric(
    this.index,
    this.wordIndex,
    this.lyric,
    this.wordInfos,
  );
}

void main() {
  final lyricsJson = {
    "sgc": false,
    "sfy": false,
    "qfy": false,
    "lrc": {
      "version": 22,
      "lyric": "[00:01.940]「どうして選ばれたのか？」\n[00:07.820]そんな問いに意味など ないと識っても\n[00:14.670]心痛は消えることなく 時計の針は廻る\n[00:31.380]\n[00:32.160]「瓦礫の終音」\n[00:33.930]Lyrics：少女病／Compose＆Arrange：ピクセルビー\n[00:35.480]Vocal：Mitsuki／Voices：花泽香菜、豊崎爱生、沢城みゆき\n[00:36.700]收录： 蒼白シスフェリア\n[00:37.840]LRC：wingull\n[00:38.840]\n[00:50.490]「この世界には、不死なる5人の魔女がいる。」\n[00:53.580]「それぞれが異なる神に見出され、人から成りし存在。」\n[00:57.940]「神を信仰する人々はその力に畏怖し、崇めた」\n[01:01.450]\n[01:02.830]「蒼白の果てで紡がれる」\n[01:04.470]「心優しい少年と一人の魔女の物語」\n[01:07.960]\n[01:09.240]褪めた日々は淀み 怠惰に溺れる\n[01:18.070]血塗られた月夜は穢れ 無垢な衝動 翳して\n[01:27.380]\n[01:28.570]変わらぬ忠誠 誓いし下僕たる少女(Servant) シルエラ\n[01:36.940]すべてを委ねた偏愛は永遠に 虚構を壊す\n[01:45.860]\n[01:46.910]「どうして選ばれたのか？」\n[01:51.250]そんな問いに意味など ないと識っても\n[01:55.970]心痛は消えることなく 残されたのはただ魔力だけ\n[02:07.050]\n[02:08.100]遠い過去の約束 まだ人間だったあの日\n[02:17.020]未来を誓った 夕暮れ(Abend)\n[02:23.010]ah...幼い恋 叶うことなくて――――\n[02:28.150]\n[02:46.050]「あたしがまだ人だった頃、小さな恋をしていた。」\n[02:50.490]「でも、あたしはもう――――！」\n[02:52.760]「手荒になってもいい。 あいつをここから遠ざけて」\n[02:56.640]「お望みのままに」\n[02:58.200]\n[02:58.260]昏い悦楽にも 精神を傾け\n[03:07.620]狂おしいほど愚かで 無慈悲な魔女、演じた\n[03:17.990]不老に近い 存在を(Sein) 愛し焦がれた シルエラ\n[03:26.280]近づく信奉者すべてを排し 独占し続ける\n[03:35.590]\n[03:36.550]いつか選ばれたのが\n[03:40.660]必然であるような 錯覺に酔う\n[03:45.480]消えゆく感情 確かに\n[03:50.700]あんなに傍にあったはずなのに\n[03:55.800]\n[04:14.010]姿だけは変わらずとも 変わり果て血に濡れた\n[04:21.130]「もう、あの頃のあたしなんかじゃない......！」\n[04:23.520]「お前が主を惑わせる。消えてなくなれ！」\n[04:26.910]\n[04:29.680]「どうしてここまで来たの......？」\n[04:33.830]変わらぬその瞳が ただ眩しくて\n[04:39.180]哀れな自らを晒すのは 決して赦されない\n[04:48.610]ここにいるのは“魔女”だけだから\n[04:54.880]\n[04:56.020]「魔女に偏愛を抱く少女は命令を自らに都合よく捻じ曲げ」\n[05:01.850]「少年の命をも狙う」\n[05:03.900]「嫉妬... 狂気... 殺意...」\n[05:08.620]\n[05:09.040]「負の感情の羅列は、死という結果のみを追い求めていた。」\n[05:15.010]「声の... 音の... 歌の連なりは、彼らを翻弄するように空へと溶けて」\n[05:22.010]\n[05:32.790]「音が聞こえる。 これは、世界が軋む音―」\n[05:41.570]\n"
    },
    "klyric": {
      "version": 0,
      "lyric": ""
    },
    "tlyric": {
      "version": 7,
      "lyric": "[00:01.940]「为什么会被选中呢？」\n[00:07.820]（诸如此类问题即使认识到了也毫无意义）\n[00:14.670]（心中的痛楚消散不去、钟表的指针无止境地转动）\n[00:31.380]\n[00:32.160]\n[00:33.930]\n[00:35.480]\n[00:36.700]\n[00:37.840]\n[00:38.840]\n[00:50.490]「这个世界上、有五个不死的魔女。」\n[00:53.580]「分别被不同的神挑选出、以人的姿态存在着。」\n[00:57.940]「信仰神的人们既畏惧着也崇拜着这种力量」\n[01:01.450]\n[01:02.830]「于苍白尽头被编织而成的、」\n[01:04.470]「心地善良的少年与一位魔女的故事」\n[01:07.960]\n[01:09.240]（褪色的日子停滞不前 沉溺于怠惰中）\n[01:18.070]（被血染红的月夜是污秽 罩住纯洁的冲动）\n[01:27.380]\n[01:28.570]（不变的忠诚 发誓成为仆人的少女 シルエラ）\n[01:36.940]（于永久中委以全部的偏爱 把虚构破坏）\n[01:45.860]\n[01:46.910] 「为什么会被选中呢？」\n[01:51.250]（诸如此类问题即使认识到了也毫无意义）\n[01:55.970]（心中的痛楚消散不去、残留下来的只有魔力而已）\n[02:07.050]\n[02:08.100]（遥远过去的约定 还是作为人类存活的那一天）\n[02:17.020]（对未来起誓的那个黄昏）\n[02:23.010] （ah...年幼时的恋情 实现不了了）\n[02:28.150]\n[02:46.050]「我还是人类的时候、曾拥有过小小的恋爱。\n[02:50.490]「但是、我已经――――！」\n[02:52.760]「即使用粗暴的方式也好。 让那家伙远离这个地方」\n[02:56.640]「如你所愿」\n[02:58.200]\n[02:58.260]（即便是昏暗的喜悦 也要倾注精神）\n[03:07.620]（像发了疯似地愚蠢 扮演着冷酷无情的魔女）\n[03:17.990]（近似永生的存在(Sein) 殷切爱恋着的シルエラ）\n[03:26.280]（把靠近的信奉者全部排除 继续独占着）\n[03:35.590]\n[03:36.550]（不知不觉被选中）\n[03:40.660]（正如必然一样 沉醉于错觉）\n[03:45.480]（感情确实在渐渐消逝）\n[03:50.700]（明明就应该待在你身旁的……）\n[03:55.800]\n[04:14.010]（即使只有身影不变 改变的结局被鲜血染红）\n[04:21.130] 「已经不是那时候的我了......！」\n[04:23.520] 「是你把主给迷惑了。给我消失吧！」\n[04:26.910]\n[04:29.680] 「为什么到这里来......？」\n[04:33.830]（毫无变化的眼眸 很耀眼）\n[04:39.180]（暴露出如此悲哀的自己 绝对不可饶恕）\n[04:48.610]（因为这里只有“魔女”的存在）\n[04:54.880]\n[04:56.020]「对魔女抱有怜悯之情的少女违背了命令」\n[05:01.850]「瞄准了少年的命」\n[05:03.900]「嫉妒... 疯狂... 杀意...」\n[05:08.620]\n[05:09.040]「罗列出负面的感情、追求着“死”这种结果。 」\n[05:15.010]「连接着的声音和歌声、愚弄他般地消散在空中」\n[05:22.010]\n[05:32.790] 「听到声音了。 这是、世界破裂的声音―」\n[05:41.570]"
    },
    "romalrc": {
      "version": 2,
      "lyric": "[00:01.940]「do u shi te e ra ba re ta no ka?」\n[00:07.820]so n na to i ni i mi na do na i to shi ki tte mo\n[00:14.670]shi n tsu u wa ki e ru ko to na ku to ke i no ha ri wa ma wa ru\n[00:31.380]\n[00:32.160]「ga re ki no o wa ri o to」\n[00:33.930]Lyrics:sho u jo byo u/Compose&Arrange:pi ku se ru bii\n[00:35.480]Vocal:Mitsuki/Voices:ha na za wa ka o ri na、yu ta ka sa ki a i na ma、sa wa shi ro mi yu ki\n[00:36.700]shu u ro ku: so u ha ku shi su fe ri a\n[00:37.840]\n[00:38.840]\n[00:50.490]「ko no se ka i ni wa、fu shi na ru go ni n no ma jo ga i ru。」\n[00:53.580]「so re zo re ga ko to na ru ka mi ni mi da sa re、hi to ka ra na ri shi so n za i。」\n[00:57.940]「ka mi wo shi n ko u su ru hi to bi to wa so no chi ka ra ni i fu shi、a ga me ta」\n[01:01.450]\n[01:02.830]「so u ha ku no ha te de tsu mu ga re ru」\n[01:04.470]「ko ko ro ya sa shi i sho u ne n to hi to ri no ma jo no mo no ga ta ri」\n[01:07.960]\n[01:09.240]sa me ta hi bi wa yo do mi ta i da ni o bo re ru\n[01:18.070]chi nu ra re ta tsu ki yo wa ke ga re mu ku na sho u do u e i shi te\n[01:27.380]\n[01:28.570]ka wa ra nu chu u se i chi ka i shi ge bo ku ta ru sho u jo shi ru e ra\n[01:36.940]su be te wo yu da ne ta he n a i wa e i e n ni kyo ko u wo ko wa su\n[01:45.860]\n[01:46.910]「do u shi te e ra ba re ta no ka?」\n[01:51.250]so n na to i ni i mi na do na i to shi ki tte mo\n[01:55.970]shi n tsu u wa ki e ru ko to na ku no ko sa re ta no wa ta da ma ryo ku da ke\n[02:07.050]\n[02:08.100]to o i ka ko no ya ku so ku ma da ni n ge n da tta a no hi\n[02:17.020]mi ra i wo chi ka tta yu u gu re\n[02:23.010]ah...o sa na i ko i ha u ko to na ku te ――――\n[02:28.150]\n[02:46.050]「a ta shi ga ma da hi to da tta go ro、chi i sa na ko i wo shi te i ta。」\n[02:50.490]「de mo、a ta shi wa mo u ――――!」\n[02:52.760]「te a ra ni na tte mo i i。 a i tsu wo ko ko ka ra to o za ke te」\n[02:56.640]「o no zo mi no ma ma ni」\n[02:58.200]\n[02:58.260]ku ra i e tsu ra ku ni mo se i shi n wo ka ta mu ke\n[03:07.620]ku ru o shi i ho do o ro ka de mu ji hi na ma jo、e n ji ta\n[03:17.990]fu ro u ni chi ka i so n za i wo i to shi ko ga re ta shi ru e ra\n[03:26.280]chi ka zu ku shi n po u sha su be te wo ha i shi do ku se n shi tsu zu ke ru\n[03:35.590]\n[03:36.550]i tsu ka e ra ba re ta no ga\n[03:40.660]hi tsu ze n de a ru yo u na sa kka ku ni yo u\n[03:45.480]ki e yu ku ka n jo u ta shi ka ni\n[03:50.700]a n na ni bo u ni a tta ha zu na no ni\n[03:55.800]\n[04:14.010]su ga ta da ke wa ka wa ra zu to mo ka wa ri ha te chi ni nu re ta\n[04:21.130]「mo u、a no go ro no a ta shi na n ka ja na i......!」\n[04:23.520]「o ma e ga shu wo ma do wa se ru。ki e te na ku na re!」\n[04:26.910]\n[04:29.680]「do u shi te ko ko ma de ki ta no......?」\n[04:33.830]ka wa ra nu so no hi to mi ga ta da ma bu shi ku te\n[04:39.180]a wa re na mi zu ka ra wo sa ra su no wa ke sshi te yu ru sa re na i\n[04:48.610]ko ko ni i ru no wa“ma jo”da ke da ka ra\n[04:54.880]\n[04:56.020]「ma jo ni he n a i wo da ku sho u jo wa me i re i wo mi zu ka ra ni tsu go u yo ku ne ji ma ge」\n[05:01.850]「sho u ne n no i no chi wo mo ne ra u」\n[05:03.900]「shi tto... kyo u ki... sa tsu i...」\n[05:08.620]\n[05:09.040]「fu no ka n jo u no ra re tsu wa、shi to i u ke kka no mi wo o i mo to me te i ta。」\n[05:15.010]「ko e no... o to no... u ta no tsu ra na ri wa、ka re ra wo ho n ro u su ru yo u ni so ra e to to ke te」\n[05:22.010]\n[05:32.790]「o to ga ki ko e ru。 ko re wa、se ka i ga ki shi mu o to ―」\n[05:41.570]"
    },
    "yrc": {
      "version": 3,
      "lyric": "[ch:0]\n[0,6810](0,1220,0)「(1220,120,0)ど(1340,660,0)う(2000,370,0)し(2370,750,0)て(3120,670,0)選(3790,140,0)ば(3930,1150,0)れ(5080,480,0)た(5560,350,0)の(5910,870,0)か(6780,30,0)？」\n[7090,6740](7090,370,0)そ(7460,270,0)ん(7730,370,0)な(8100,140,0)問(8240,590,0)い(8830,670,0)に(9500,30,0)意(9530,290,0)味(9820,230,0)な(10050,510,0)ど (10560,540,0)な(11100,240,0)い(11340,880,0)と(12220,930,0)識(13150,130,0)っ(13280,190,0)て(13470,360,0)も\n[14130,14630](14130,280,0)心(14410,2130,0)痛(16540,490,0)は(17030,310,0)消(17340,660,0)え(18000,780,0)る(18780,160,0)こ(18940,1200,0)と(20140,170,0)な(20310,1480,0)く (21790,460,0)時(22250,800,0)計(23050,1320,0)の(24370,390,0)針(24760,1340,0)は(26100,1520,0)廻(27620,1140,0)る\n[28760,3810](28760,544,0)「(29304,544,0)瓦(29848,544,0)礫(30392,544,0)の(30936,544,0)終(31480,544,0)音(32024,546,0)」\n[32570,7150](32570,446,0)Lyrics(33016,446,0)：(33462,446,0)少(33908,446,0)女(34354,446,0)病(34800,446,0)／(35246,446,0)Compose(35692,446,0)＆(36138,446,0)Arrange(36584,446,0)：(37030,446,0)ピ(37476,446,0)ク(37922,446,0)セ(38368,446,0)ル(38814,446,0)ビ(39260,460,0)ー\n[39720,8380](39720,399,0)Vocal(40119,399,0)：(40518,399,0)Mitsuki(40917,399,0)／(41316,399,0)Voices(41715,399,0)：(42114,399,0)花(42513,399,0)泽(42912,399,0)香(43311,399,0)菜(43710,399,0)、(44109,399,0)豊(44508,399,0)崎(44907,399,0)爱(45306,399,0)生(45705,399,0)、(46104,399,0)沢(46503,399,0)城(46902,399,0)み(47301,399,0)ゆ(47700,400,0)き\n[48100,450](48100,40,0)收(48140,40,0)录(48180,40,0)： (48220,40,0)蒼(48260,40,0)白(48300,40,0)シ(48340,40,0)ス(48380,40,0)フ(48420,40,0)ェ(48460,40,0)リ(48500,50,0)ア\n[48550,30](48550,10,0)LRC(48560,10,0)：(48570,10,0)wingull\n[48580,4260](48580,1000,0)「(49580,210,0)こ(49790,130,0)の(49920,150,0)世(50070,250,0)界(50320,120,0)に(50440,160,0)は(50600,170,0)、(50770,140,0)不(50910,160,0)死(51070,110,0)な(51180,170,0)る(51350,40,0)5(51390,320,0)人(51710,100,0)の(51810,130,0)魔(51940,150,0)女(52090,110,0)が(52200,110,0)い(52310,500,0)る(52810,30,0)。」\n[52840,3680](52840,30,0)「(52870,230,0)そ(53100,110,0)れ(53210,110,0)ぞ(53320,120,0)れ(53440,80,0)が(53520,250,0)異(53770,130,0)な(53900,120,0)る(54020,440,0)神(54460,60,0)に(54520,120,0)見(54640,80,0)出(54720,170,0)さ(54890,60,0)れ(54950,300,0)、(55250,300,0)人(55550,110,0)か(55660,90,0)ら(55750,120,0)成(55870,100,0)り(55970,190,0)し(56160,200,0)存(56360,130,0)在(56490,30,0)。」\n[56520,4950](56520,630,0)「(57150,310,0)神(57460,60,0)を(57520,260,0)信(57780,160,0)仰(57940,160,0)す(58100,90,0)る(58190,200,0)人(58390,210,0)々(58600,140,0)は(58740,140,0)そ(58880,120,0)の(59000,370,0)力(59370,150,0)に(59520,100,0)畏(59620,110,0)怖(59730,280,0)し(60010,110,0)、(60120,300,0)崇(60420,350,0)め(60770,220,0)た(60990,480,0)」\n[61470,2380](61470,480,0)「(61950,320,0)蒼(62270,240,0)白(62510,90,0)の(62600,140,0)果(62740,100,0)て(62840,130,0)で(62970,260,0)紡(63230,100,0)が(63330,150,0)れ(63480,230,0)る(63710,140,0)」\n[63850,4770](63850,150,0)「(64000,360,0)心(64360,270,0)優(64630,140,0)し(64770,130,0)い(64900,250,0)少(65150,260,0)年(65410,440,0)と(65850,310,0)一(66160,150,0)人(66310,140,0)の(66450,170,0)魔(66620,170,0)女(66790,100,0)の(66890,290,0)物(67180,320,0)語(67500,1120,0)」\n[68620,8770](68620,30,0)褪(68650,250,0)め(68900,890,0)た(69790,440,0)日(70230,360,0)々(70590,540,0)は(71130,160,0)淀(71290,1280,0)み (72570,920,0)怠(73490,130,0)惰(73620,1510,0)に(75130,320,0)溺(75450,410,0)れ(75860,1530,0)る\n[77550,10150](77550,280,0)血(77830,120,0)塗(77950,250,0)ら(78200,150,0)れ(78350,980,0)た(79330,120,0)月(79450,390,0)夜(79840,400,0)は(80240,510,0)穢(80750,1210,0)れ (81960,380,0)無(82340,170,0)垢(82510,870,0)な(83380,960,0)衝(84340,1800,0)動 (86140,180,0)翳(86320,190,0)し(86510,1190,0)て\n[87930,8030](87930,300,0)変(88230,900,0)わ(89130,330,0)ら(89460,430,0)ぬ(89890,510,0)忠(90400,1300,0)誠 (91700,490,0)誓(92190,140,0)い(92330,160,0)し(92490,80,0)下(92570,130,0)僕(92700,100,0)た(92800,190,0)る(92990,80,0)少(93070,320,0)女(93390,10,0)（(93400,10,0)Servant(93410,20,0)） (93430,380,0)シ(93810,220,0)ル(94030,400,0)エ(94430,1530,0)ラ\n[96060,9730](96060,330,0)す(96390,160,0)べ(96550,130,0)て(96680,650,0)を(97330,1270,0)委(98600,320,0)ね(98920,470,0)た(99390,120,0)偏(99510,720,0)愛(100230,730,0)は(100960,280,0)永(101240,190,0)遠(101430,2150,0)に (103580,220,0)虚(103800,290,0)構(104090,1130,0)を(105220,120,0)壊(105340,450,0)す\n[105790,4690](105790,780,0)「(106570,80,0)ど(106650,460,0)う(107110,220,0)し(107330,280,0)て(107610,730,0)選(108340,110,0)ば(108450,800,0)れ(109250,310,0)た(109560,130,0)の(109690,760,0)か(110450,30,0)？」\n[110510,4770](110510,250,0)そ(110760,130,0)ん(110890,400,0)な(111290,290,0)問(111580,320,0)い(111900,280,0)に(112180,140,0)意(112320,190,0)味(112510,140,0)な(112650,360,0)ど (113010,390,0)な(113400,570,0)い(113970,230,0)と(114200,450,0)識(114650,60,0)っ(114710,140,0)て(114850,430,0)も\n[115430,11250](115430,110,0)心(115540,680,0)痛(116220,1270,0)は(117490,300,0)消(117790,360,0)え(118150,1070,0)る(119220,80,0)こ(119300,300,0)と(119600,130,0)な(119730,840,0)く (120570,780,0)残(121350,320,0)さ(121670,590,0)れ(122260,300,0)た(122560,160,0)の(122720,180,0)は(122900,830,0)た(123730,880,0)だ(124610,60,0)魔(124670,120,0)力(124790,80,0)だ(124870,1810,0)け\n[126930,8840](126930,660,0)遠(127590,870,0)い(128460,150,0)過(128610,700,0)去(129310,340,0)の(129650,390,0)約(130040,1610,0)束 (131650,360,0)ま(132010,250,0)だ(132260,950,0)人(133210,250,0)間(133460,860,0)だ(134320,70,0)っ(134390,290,0)た(134680,110,0)あ(134790,120,0)の(134910,860,0)日\n[136050,5040](136050,380,0)未(136430,490,0)来(136920,350,0)を(137270,620,0)誓(137890,190,0)っ(138080,2440,0)た (140520,60,0)夕(140580,70,0)暮(140650,300,0)れ(140950,40,0)（(140990,40,0)Abend(141030,60,0)）\n[141090,8980](141090,1330,0)ah(142420,40,0).(142460,40,0).(142500,60,0).(142560,930,0)幼(143490,380,0)い(143870,1090,0)恋 (144960,590,0)叶(145550,70,0)う(145620,130,0)こ(145750,560,0)と(146310,340,0)な(146650,150,0)く(146800,3240,0)て(150040,30,0)――――\n[150070,19980](150070,15450,0)「(165520,140,0)あ(165660,100,0)た(165760,140,0)し(165900,120,0)が(166020,140,0)ま(166160,110,0)だ(166270,230,0)人(166500,120,0)だ(166620,60,0)っ(166680,110,0)た(166790,330,0)頃(167120,550,0)、(167670,280,0)小(167950,170,0)さ(168120,150,0)な(168270,300,0)恋(168570,50,0)を(168620,130,0)し(168750,70,0)て(168820,120,0)い(168940,1080,0)た(170020,30,0)。」\n[170050,2650](170050,0,0)「(170050,120,0)で(170170,200,0)も(170370,500,0)、(170870,170,0)あ(171040,100,0)た(171140,140,0)し(171280,120,0)は(171400,200,0)も(171600,1070,0)う(172670,30,0)――――！」\n[172700,3340](172700,0,0)「(172700,90,0)手(172790,190,0)荒(172980,120,0)に(173100,120,0)な(173220,50,0)っ(173270,80,0)て(173350,140,0)も(173490,130,0)い(173620,250,0)い(173870,440,0)。 (174310,150,0)あ(174460,100,0)い(174560,150,0)つ(174710,70,0)を(174780,140,0)こ(174920,80,0)こ(175000,110,0)か(175110,140,0)ら(175250,180,0)遠(175430,120,0)ざ(175550,120,0)け(175670,110,0)て(175780,260,0)」\n[176040,1710](176040,260,0)「(176300,150,0)お(176450,290,0)望(176740,120,0)み(176860,120,0)の(176980,150,0)ま(177130,150,0)ま(177280,60,0)に(177340,410,0)」\n[177750,9010](177750,710,0)昏(178460,990,0)い(179450,160,0)悦(179610,770,0)楽(180380,260,0)に(180640,2300,0)も (182940,60,0)精(183000,1240,0)神(184240,60,0)を(184300,880,0)傾(185180,1580,0)け\n[186890,9930](186890,410,0)狂(187300,160,0)お(187460,1270,0)し(188730,30,0)い(188760,310,0)ほ(189070,150,0)ど(189220,580,0)愚(189800,300,0)か(190100,1250,0)で (191350,630,0)無(191980,690,0)慈(192670,360,0)悲(193030,670,0)な(193700,350,0)魔(194050,910,0)女(194960,240,0)、(195200,470,0)演(195670,180,0)じ(195850,970,0)た\n[197190,8100](197190,230,0)不(197420,1030,0)老(198450,300,0)に(198750,800,0)近(199550,200,0)い (199750,90,0)存(199840,650,0)在(200490,70,0)を(200560,190,0)（(200750,190,0)Sein(200940,200,0)） (201140,270,0)愛(201410,380,0)し(201790,120,0)焦(201910,280,0)が(202190,160,0)れ(202350,520,0)た (202870,320,0)シ(203190,390,0)ル(203580,190,0)エ(203770,1520,0)ラ\n[205470,9630](205470,430,0)近(205900,150,0)づ(206050,670,0)く(206720,650,0)信(207370,1060,0)奉(208430,370,0)者(208800,200,0)す(209000,410,0)べ(209410,190,0)て(209600,660,0)を(210260,480,0)排(210740,2180,0)し (212920,230,0)独(213150,150,0)占(213300,120,0)し(213420,750,0)続(214170,200,0)け(214370,730,0)る\n[215900,3930](215900,300,0)い(216200,490,0)つ(216690,470,0)か(217160,550,0)選(217710,130,0)ば(217840,790,0)れ(218630,280,0)た(218910,160,0)の(219070,760,0)が\n[219880,4880](219880,350,0)必(220230,750,0)然(220980,210,0)で(221190,260,0)あ(221450,290,0)る(221740,210,0)よ(221950,60,0)う(222010,320,0)な (222330,1020,0)錯(223350,440,0)覺(223790,290,0)に(224080,520,0)酔(224600,160,0)う\n[224790,5150](224790,150,0)消(224940,400,0)え(225340,220,0)ゆ(225560,1240,0)く(226800,90,0)感(226890,1150,0)情 (228040,900,0)確(228940,160,0)か(229100,840,0)に\n[230390,6670](230390,70,0)あ(230460,270,0)ん(230730,290,0)な(231020,550,0)に(231570,510,0)傍(232080,260,0)に(232340,950,0)あ(233290,100,0)っ(233390,330,0)た(233720,510,0)は(234230,140,0)ず(234370,320,0)な(234690,140,0)の(234830,2230,0)に\n[253010,7370](253010,930,0)姿(253940,280,0)だ(254220,110,0)け(254330,1190,0)は(255520,210,0)変(255730,400,0)わ(256130,140,0)ら(256270,310,0)ず(256580,160,0)と(256740,1010,0)も (257750,220,0)変(257970,140,0)わ(258110,380,0)り(258490,180,0)果(258670,320,0)て(258990,250,0)血(259240,340,0)に(259580,300,0)濡(259880,290,0)れ(260170,210,0)た\n[260380,1870](260380,98,0)「(260478,98,0)も(260576,98,0)う(260674,98,0)、(260772,98,0)あ(260870,98,0)の(260968,98,0)頃(261066,98,0)の(261164,98,0)あ(261262,98,0)た(261360,98,0)し(261458,98,0)な(261556,98,0)ん(261654,98,0)か(261752,98,0)じ(261850,98,0)ゃ(261948,98,0)な(262046,98,0)い(262144,106,0)......！」\n[262250,6130](262250,100,0)「(262350,190,0)お(262540,330,0)前(262870,160,0)が(263030,420,0)主(263450,80,0)を(263530,320,0)惑(263850,120,0)わ(263970,150,0)せ(264120,80,0)る(264200,810,0)。(265010,270,0)消(265280,140,0)え(265420,120,0)て(265540,150,0)な(265690,100,0)く(265790,130,0)な(265920,2430,0)れ(268350,30,0)！」\n[268380,4790](268380,740,0)「(269120,100,0)ど(269220,460,0)う(269680,220,0)し(269900,420,0)て(270320,300,0)こ(270620,290,0)こ(270910,310,0)ま(271220,560,0)で(271780,350,0)来(272130,120,0)た(272250,890,0)の(273140,30,0)......？」\n[273170,5230](273170,130,0)変(273300,160,0)わ(273460,430,0)ら(273890,220,0)ぬ(274110,370,0)そ(274480,100,0)の(274580,660,0)瞳(275240,400,0)が (275640,290,0)た(275930,610,0)だ(276540,400,0)眩(276940,300,0)し(277240,170,0)く(277410,990,0)て\n[278580,9390](278580,640,0)哀(279220,840,0)れ(280060,260,0)な(280320,750,0)自(281070,500,0)ら(281570,360,0)を(281930,500,0)晒(282430,310,0)す(282740,190,0)の(282930,1840,0)は (284770,290,0)決(285060,210,0)し(285270,1190,0)て(286460,100,0)赦(286560,330,0)さ(286890,220,0)れ(287110,430,0)な(287540,430,0)い\n[288000,7410](288000,70,0)こ(288070,600,0)こ(288670,800,0)に(289470,110,0)い(289580,270,0)る(289850,160,0)の(290010,900,0)は(290910,30,0)“(290940,330,0)魔(291270,460,0)女(291730,30,0)”(291760,400,0)だ(292160,170,0)け(292330,310,0)だ(292640,170,0)か(292810,2600,0)ら\n[295410,5210](295410,30,0)「(295440,210,0)魔(295650,160,0)女(295810,100,0)に(295910,350,0)偏(296260,170,0)愛(296430,80,0)を(296510,180,0)抱(296690,120,0)く(296810,220,0)少(297030,190,0)女(297220,580,0)は(297800,370,0)命(298170,150,0)令(298320,140,0)を(298460,410,0)自(298870,120,0)ら(298990,180,0)に(299170,150,0)都(299320,210,0)合(299530,150,0)よ(299680,130,0)く(299810,110,0)捻(299920,150,0)じ(300070,130,0)曲(300200,160,0)げ(300360,260,0)」\n[300620,2360](300620,260,0)「(300880,320,0)少(301200,230,0)年(301430,120,0)の(301550,400,0)命(301950,50,0)を(302000,130,0)も(302130,300,0)狙(302430,70,0)う(302500,480,0)」\n[302980,4360](302980,480,0)「(303460,630,0)嫉(304090,200,0)妬(304290,290,0).(304580,290,0).(304870,290,0). (305160,350,0)狂(305510,340,0)気(305850,280,0).(306130,280,0).(306410,280,0). (306690,590,0)殺(307280,30,0)意(307310,30,0)...」\n[307340,5650](307340,1350,0)「(308690,220,0)負(308910,150,0)の(309060,230,0)感(309290,160,0)情(309450,180,0)の(309630,110,0)羅(309740,280,0)列(310020,240,0)は(310260,500,0)、(310760,210,0)死(310970,130,0)と(311100,160,0)い(311260,70,0)う(311330,200,0)結(311530,100,0)果(311630,170,0)の(311800,180,0)み(311980,70,0)を(312050,100,0)追(312150,40,0)い(312190,240,0)求(312430,150,0)め(312580,90,0)て(312670,110,0)い(312780,180,0)た(312960,30,0)。」\n[312990,18120](312990,1100,0)「(314090,310,0)声(314400,180,0)の(314580,220,0).(314800,220,0).(315020,230,0). (315250,460,0)音(315710,720,0)の(316430,100,0).(316530,100,0).(316630,120,0). (316750,340,0)歌(317090,150,0)の(317240,240,0)連(317480,120,0)な(317600,130,0)り(317730,300,0)は(318030,500,0)、(318530,300,0)彼(318830,170,0)ら(319000,90,0)を(319090,260,0)翻(319350,120,0)弄(319470,180,0)す(319650,120,0)る(319770,70,0)よ(319840,80,0)う(319920,130,0)に(320050,810,0)空(320860,6230,0)へ(327090,3130,0)と(330220,90,0)溶(330310,60,0)け(330370,60,0)て(330430,680,0)」\n[331110,13040](331110,690,0)「(331800,340,0)音(332140,170,0)が(332310,190,0)聞(332500,140,0)こ(332640,170,0)え(332810,60,0)る(332870,1210,0)。 (334080,200,0)こ(334280,160,0)れ(334440,330,0)は(334770,490,0)、(335260,390,0)世(335650,360,0)界(336010,550,0)が(336560,160,0)軋(336720,320,0)む(337040,7080,0)音(344120,30,0)―」\n"
    },
    "code": 200,
    "roles": []
  };

  final container = LyricParser.parse(jsonEncode(lyricsJson));
  final scheduler = NextWordBasedLyricScheduler(
      container, StreamController<Duration>().stream);
  scheduler.prepare();

  for (final lyric in scheduler.correctedLyrics!) {
    print('${lyric.text} | ${lyric.romanText} | ${lyric.translatedText}');
    print('${lyric.position} | ${lyric.wordBasedLyric!.duration}');
    print('--------------');
  }
}

class NextWordBasedLyricScheduler {
  final LyricsContainer lyricsContainer;
  final Stream<Duration> positionStream;

  List<CombinedLyric>? correctedLyrics;

  int? previousWordIndex;
  List<ChunkedLyric>? chunkedLyrics;
  BehaviorSubject<ScheduledWordBasedLyric?>? lyricSubject;
  StreamSubscription? positionSubscription;

  NextWordBasedLyricScheduler(this.lyricsContainer, this.positionStream);

  void prepare() {
    correctedLyrics = NextWordBasedLyricCorrector.correctLyrics(
      lyricsContainer,
    );
    lyricSubject = BehaviorSubject.seeded(null);
  }

  void start() {
    if (correctedLyrics == null) {
      return;
    }
    chunkedLyrics = LyricChunker.makeLyrics(correctedLyrics!);
    positionSubscription = positionStream.listen(_onPosition);
  }

  void _onPosition(Duration position) {
    if (correctedLyrics == null || correctedLyrics?.isEmpty == true) {
      return;
    }
    if (chunkedLyrics == null || chunkedLyrics?.isEmpty == true) {
      return;
    }
    if (lyricSubject == null || lyricSubject?.isClosed == true) {
      return;
    }
    int? index;
    ChunkedLyric? chunkedLyric;

    for (int i = 0; i < chunkedLyrics!.length; i++) {
      final chunk = chunkedLyrics![i];
      if (chunk.contains(position)) {
        index = i;
        chunkedLyric = chunk;
        break;
      }
    }
    if (index == null || chunkedLyric == null) {
      return;
    }

    final wordBasedLyric = chunkedLyric.lyric.wordBasedLyric;
    if (wordBasedLyric == null) {
      return;
    }
    if (wordBasedLyric.wordInfos == null ||
        wordBasedLyric.wordInfos?.isEmpty == true) {
      return;
    }

    int? wordIndex;
    ChunkedWordInfo? chunkedWordInfo;
    final chunkedWordInfos = LyricChunker.makeWordInfos(
      wordBasedLyric.wordInfos!,
    );
    for (int i = 0; i < chunkedWordInfos.length; i++) {
      final chunk = chunkedWordInfos[i];
      if (chunk.contains(position)) {
        wordIndex = i;
        chunkedWordInfo = chunk;
        break;
      }
    }
    if (wordIndex == null || chunkedWordInfo == null) {
      return;
    }
    if (wordIndex == previousWordIndex) {
      return;
    }
    previousWordIndex = wordIndex;

    lyricSubject?.add(
      ScheduledWordBasedLyric(
        index,
        wordIndex,
        chunkedLyric.lyric,
        wordBasedLyric.wordInfos!,
      ),
    );
  }

  void dispose() {
    chunkedLyrics?.clear();
    chunkedLyrics = null;
    lyricSubject?.close();
    lyricSubject = null;
    positionSubscription?.cancel();
    positionSubscription = null;
  }
}
